app/Controllers/ClientController.php

SELECT *
FROM `villes`
ORDER BY `nom` ASC
---
    public function catalogue(): string
    {
        $idVille = $this->request->getGet('ville') ? (int) $this->request->getGet('ville') : null;

        $maisons = $this->maisonModel->listerDisponibles($idVille);
        $villes  = $this->villeModel->orderBy('nom', 'ASC')->findAll();

SELECT *
FROM `contrats`
WHERE `id_client` = 3
AND `id_maison` = 5
ORDER BY `cree_le` DESC
 LIMIT 1
---
    public function mesDemandes(): string
    {
        $demandes = $this->demandeModel->pourClient(session('id_utilisateur'));

        $contratModel = new ContratModel();
        foreach ($demandes as &$demande) {
            $demande['contrat'] = $contratModel
                ->where('id_client', (int) session('id_utilisateur'))
                ->where('id_maison', (int) $demande['id_maison'])
                ->orderBy('cree_le', 'DESC')
                ->first();