app/Controllers/ClientController.php

    public function profil(): string
    {
        $utilisateur = $this->utilisateurModel->find(session('id_utilisateur'));
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id_utilisateur` = '3'