app/Controllers/ContratController.php

    public function signerLocataire(int $idContrat)
    {
        $contrat = $this->chargerContratAccessible($idContrat, (int) session('id_utilisateur'), 'client');
        if ($contrat === null) {
            return redirect()->to('/client/mes-demandes')->with('erreur', 'Contrat introuvable.');
        }

        $signatureModel = new SignatureModel();
        $signatureExistante = $signatureModel
            ->where('id_contrat', $idContrat)
            ->where('role_signataire', 'locataire')
            ->first();

        if ($signatureExistante !== null) {
            return redirect()->back()->with('info', 'Le locataire a déjà signé ce contrat.');
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id_utilisateur` = 3