app/Controllers/ContratController.php

SELECT `contrats`.*, `types_contrat`.`code` AS `type_code`, `types_contrat`.`libelle` AS `type_libelle`, `types_contrat`.`preavis_mois`, `types_contrat`.`modele_html`, `fiches_fiscales`.`id_fiche`, `fiches_fiscales`.`montant_total_loyers`, `fiches_fiscales`.`taux_applique`, `fiches_fiscales`.`montant_droit` AS `fiche_montant_droit`, `fiches_fiscales`.`date_limite_enreg`, `fiches_fiscales`.`statut_enregistrement`, `fiches_fiscales`.`chemin_pdf` AS `fiche_pdf`, `contrats`.*, `maisons`.`titre` AS `maison_titre`, `client`.`nom` AS `client_nom`, `client`.`prenoms` AS `client_prenoms`
FROM `contrats`
LEFT JOIN `types_contrat` ON `types_contrat`.`id_type_contrat` = `contrats`.`id_type_contrat`
LEFT JOIN `fiches_fiscales` ON `fiches_fiscales`.`id_contrat` = `contrats`.`id_contrat`
JOIN `maisons` ON `maisons`.`id_maison` = `contrats`.`id_maison`
JOIN `utilisateurs` `client` ON `client`.`id_utilisateur` = `contrats`.`id_client`
JOIN `utilisateurs` `bailleur` ON `bailleur`.`id_utilisateur` = `contrats`.`id_proprietaire`
WHERE `contrats`.`id_proprietaire` = 2
ORDER BY `contrats`.`cree_le` DESC
---
    public function indexProprietaire(): string
    {
        $contrats = (new ContratModel())
            ->avecRelations()
            ->select('contrats.*, maisons.titre AS maison_titre, client.nom AS client_nom, client.prenoms AS client_prenoms')
            ->join('maisons', 'maisons.id_maison = contrats.id_maison')
            ->join('utilisateurs client', 'client.id_utilisateur = contrats.id_client')
            ->join('utilisateurs bailleur', 'bailleur.id_utilisateur = contrats.id_proprietaire')
            ->where('contrats.id_proprietaire', (int) session('id_utilisateur'))
            ->orderBy('contrats.cree_le', 'DESC')
            ->findAll();

SELECT *
FROM `signatures`
WHERE `id_contrat` = 3
AND `role_signataire` = 'bailleur'
 LIMIT 1
---
    private function relancerSignatureContratSiNecessaire(array $contrat): void
    {
        $dateCreation = $contrat['cree_le'] ?? date('Y-m-d H:i:s');
        $dateLimite = strtotime($dateCreation . ' +7 days');
        $now = time();

        if ($now < $dateLimite) {
            return;
        }

        $signatureBailleur = (new SignatureModel())
            ->where('id_contrat', (int) $contrat['id_contrat'])
            ->where('role_signataire', 'bailleur')
            ->first();

SELECT `demandes`.*, `dossiers_location`.`id_dossier`, `dossiers_location`.`usage_declare`, `dossiers_location`.`nb_occupants`, `dossiers_location`.`situation_client`, `dossiers_location`.`activite_declaree`
FROM `demandes`
LEFT JOIN `dossiers_location` ON `dossiers_location`.`id_demande` = `demandes`.`id_demande`
WHERE `demandes`.`id_demande` = 1
 LIMIT 1
---
    private function chargerContexteGenerer(int $idDemande): ?array
    {
        $demande = (new DemandeModel())
            ->select('demandes.*, dossiers_location.id_dossier, dossiers_location.usage_declare, dossiers_location.nb_occupants, dossiers_location.situation_client, dossiers_location.activite_declaree')
            ->join('dossiers_location', 'dossiers_location.id_demande = demandes.id_demande', 'left')
            ->where('demandes.id_demande', $idDemande)
            ->first();

        if ($demande === null) {
            return null;
        }

        $maison = (new MaisonModel())->find((int) $demande['id_maison']);
        $client = (new UtilisateurModel())->find((int) $demande['id_client']);
        if ($maison === null || $client === null) {
            return null;
        }

        $proprietaire = (new UtilisateurModel())->find((int) $maison['id_proprietaire']);

SELECT `contrats`.*, `types_contrat`.`code` AS `type_code`, `types_contrat`.`libelle` AS `type_libelle`, `types_contrat`.`preavis_mois`, `types_contrat`.`modele_html`, `fiches_fiscales`.`id_fiche`, `fiches_fiscales`.`montant_total_loyers`, `fiches_fiscales`.`taux_applique`, `fiches_fiscales`.`montant_droit` AS `fiche_montant_droit`, `fiches_fiscales`.`date_limite_enreg`, `fiches_fiscales`.`statut_enregistrement`, `fiches_fiscales`.`chemin_pdf` AS `fiche_pdf`, `contrats`.*, `maisons`.`titre` AS `maison_titre`, `maisons`.`adresse` AS `maison_adresse`, `maisons`.`usage_autorise`, `maisons`.`loyer_mensuel` AS `loyer_maison`, `maisons`.`valeur_immeuble`, `maisons`.`date_construction`, `maisons`.`nb_chambres`, `maisons`.`id_proprietaire` AS `maison_proprietaire`, `client`.`nom` AS `client_nom`, `client`.`prenoms` AS `client_prenoms`, `client`.`cin_numero`, `client`.`nif`, `client`.`stat`, `bailleur`.`nom` AS `proprietaire_nom`, `bailleur`.`prenoms` AS `proprietaire_prenoms`
FROM `contrats`
LEFT JOIN `types_contrat` ON `types_contrat`.`id_type_contrat` = `contrats`.`id_type_contrat`
LEFT JOIN `fiches_fiscales` ON `fiches_fiscales`.`id_contrat` = `contrats`.`id_contrat`
JOIN `maisons` ON `maisons`.`id_maison` = `contrats`.`id_maison`
JOIN `utilisateurs` `client` ON `client`.`id_utilisateur` = `contrats`.`id_client`
JOIN `utilisateurs` `bailleur` ON `bailleur`.`id_utilisateur` = `contrats`.`id_proprietaire`
WHERE `contrats`.`id_contrat` = 2
 LIMIT 1
SELECT *
FROM `signatures`
WHERE `id_contrat` = 2
ORDER BY `signe_le` ASC
---
    private function chargerContratAccessible(int $idContrat, int $idUtilisateur, ?string $role = null): ?array
    {
        if ($role === null || ! in_array($role, ['proprietaire', 'client'], true)) {
            return null;
        }

        $contrat = (new ContratModel())->avecRelations()
            ->select('contrats.*, maisons.titre AS maison_titre, maisons.adresse AS maison_adresse, maisons.usage_autorise, maisons.loyer_mensuel AS loyer_maison, maisons.valeur_immeuble, maisons.date_construction, maisons.nb_chambres, maisons.id_proprietaire AS maison_proprietaire, client.nom AS client_nom, client.prenoms AS client_prenoms, client.cin_numero, client.nif, client.stat, bailleur.nom AS proprietaire_nom, bailleur.prenoms AS proprietaire_prenoms')
            ->join('maisons', 'maisons.id_maison = contrats.id_maison')
            ->join('utilisateurs client', 'client.id_utilisateur = contrats.id_client')
            ->join('utilisateurs bailleur', 'bailleur.id_utilisateur = contrats.id_proprietaire')
            ->where('contrats.id_contrat', $idContrat)
            ->first();

        if ($contrat === null) {
            return null;
        }

        if ($role === 'proprietaire' && (int) $contrat['id_proprietaire'] !== $idUtilisateur) {
            return null;
        }

        if ($role === 'client' && (int) $contrat['id_client'] !== $idUtilisateur) {
            return null;
        }

        $contrat['avenants'] = (new AvenantModel())->pourContrat($idContrat);
        $contrat['ficheFiscale'] = (new FicheFiscaleModel())->pourContrat($idContrat);
        $contrat['signatures'] = (new SignatureModel())
            ->where('id_contrat', $idContrat)
            ->orderBy('signe_le', 'ASC')
            ->findAll();