app/Controllers/ContratController.php

            'message' => 'Le bailleur a signé l’avenant. Veuillez continuer la validation.',
        ]);

        return redirect()->to('/proprietaire/contrats/' . $avenant['id_contrat'])->with('succes', 'Signature de l’avenant enregistrée.');
---
SELECT *
FROM `contrats`
WHERE `contrats`.`id_contrat` = 3
SELECT *
FROM `signatures`
WHERE `id_contrat` = 3