app/Controllers/DemandeController.php

    public function index(): string
    {
        $demandeModel = new DemandeModel();

        $demandes = $demandeModel
            ->select('demandes.*, maisons.titre AS maison_titre, utilisateurs.nom AS client_nom, utilisateurs.prenoms AS client_prenoms, utilisateurs.telephone AS client_telephone')
            ->join('maisons', 'maisons.id_maison = demandes.id_maison')
            ->join('utilisateurs', 'utilisateurs.id_utilisateur = demandes.id_client')
            ->where('maisons.id_proprietaire', (int) session('id_utilisateur'))
            ->orderBy('demandes.date_demande', 'DESC')
            ->findAll();
---
SELECT `demandes`.*, `maisons`.`titre` AS `maison_titre`, `utilisateurs`.`nom` AS `client_nom`, `utilisateurs`.`prenoms` AS `client_prenoms`, `utilisateurs`.`telephone` AS `client_telephone`
FROM `demandes`
JOIN `maisons` ON `maisons`.`id_maison` = `demandes`.`id_maison`
JOIN `utilisateurs` ON `utilisateurs`.`id_utilisateur` = `demandes`.`id_client`
WHERE `maisons`.`id_proprietaire` = 2
ORDER BY `demandes`.`date_demande` DESC