app/Controllers/MaisonController.php

SELECT *
FROM `villes`
---
    public function formulaireAjout(): string
    {
        return view('proprietaire/maisons/formulaire', [
            'maison' => null,
            'villes' => (new VilleModel())->findAll(),

INSERT INTO `maison_photos` (`id_maison`, `chemin`, `ordre`) VALUES (5, 'uploads/maisons/5/1790711827_7c7830527937116dbc80.jpeg', 0)
---
    public function ajouterPhoto(int $idMaison)
    {
        $maison = $this->recupererMaisonDuProprietaire($idMaison);

        if ($maison === null) {
            return redirect()->to('/proprietaire/maisons')->with('erreur', 'Maison introuvable.');
        }

        $fichier = $this->request->getFile('photo');

        if ($fichier === null || ! $fichier->isValid() || $fichier->hasMoved()) {
            return redirect()->back()->with('erreur', 'Aucune photo valide reçue.');
        }

        if (! in_array($fichier->getClientMimeType(), ['image/jpeg', 'image/png', 'image/webp'], true)) {
            return redirect()->back()->with('erreur', "Format d'image non supporté (jpeg, png, webp uniquement).");
        }

        $nomFichier = $fichier->getRandomName();
        $dossier    = 'uploads/maisons/' . $idMaison;
        $fichier->move(FCPATH . $dossier, $nomFichier);

        (new MaisonPhotoModel())->insert([
            'id_maison' => $idMaison,
            'chemin'    => $dossier . '/' . $nomFichier,
            'ordre'     => (int) ($this->request->getPost('ordre') ?? 0),
        ]);

SELECT *
FROM `maison_photos`
WHERE `maison_photos`.`id_photo` = 10
DELETE FROM `maison_photos`
WHERE `id_photo` IN (10)
---
    public function supprimerPhoto(int $idMaison, int $idPhoto)
    {
        $maison = $this->recupererMaisonDuProprietaire($idMaison);

        if ($maison === null) {
            return redirect()->to('/proprietaire/maisons')->with('erreur', 'Maison introuvable.');
        }

        $photoModel = new MaisonPhotoModel();
        $photo      = $photoModel->find($idPhoto);

        if ($photo !== null && (int) $photo['id_maison'] === $idMaison) {
            $chemin = FCPATH . $photo['chemin'];

            if (is_file($chemin)) {
                unlink($chemin);
            }

            $photoModel->delete($idPhoto);

SELECT *
FROM `maisons`
WHERE `maisons`.`id_maison` = 6
---
    private function recupererMaisonDuProprietaire(int $idMaison): ?array
    {
        $maison = (new MaisonModel())->find($idMaison);