app/Models/AvenantModel.php

    public function numeroSuivantPourContrat(int $idContrat): int
    {
        $dernier = $this->where('id_contrat', $idContrat)
            ->orderBy('numero_avenant', 'DESC')
            ->first();
---
SELECT *
FROM `avenants`
WHERE `id_contrat` = 3
ORDER BY `numero_avenant` DESC