app/Models/ContratModel.php

SELECT `contrats`.*, `maisons`.`titre`, `types_contrat`.`libelle` AS `type_libelle`
FROM `contrats`
JOIN `maisons` ON `maisons`.`id_maison` = `contrats`.`id_maison`
JOIN `types_contrat` ON `types_contrat`.`id_type_contrat` = `contrats`.`id_type_contrat`
WHERE `contrats`.`id_client` = 3
ORDER BY `contrats`.`cree_le` DESC
---
    public function pourClient(int $idClient): array
    {
        return $this->select('contrats.*, maisons.titre, types_contrat.libelle AS type_libelle')
            ->join('maisons', 'maisons.id_maison = contrats.id_maison')
            ->join('types_contrat', 'types_contrat.id_type_contrat = contrats.id_type_contrat')
            ->where('contrats.id_client', $idClient)
            ->orderBy('contrats.cree_le', 'DESC')
            ->findAll();