app/Models/DemandeModel.php

    public function aDemandeEnCours(int $idMaison, int $idClient): bool
    {
        return $this->where('id_maison', $idMaison)
            ->where('id_client', $idClient)
            ->where('statut', 'envoyee')
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `demandes`
WHERE `id_maison` = 1
AND `id_client` = 3
AND `statut` = 'envoyee'

    public function pourClient(int $idClient): array
    {
        return $this->select('demandes.*, maisons.titre, maisons.loyer_mensuel, villes.nom AS nom_ville')
            ->join('maisons', 'maisons.id_maison = demandes.id_maison')
            ->join('villes', 'villes.id_ville = maisons.id_ville')
            ->where('demandes.id_client', $idClient)
            ->orderBy('demandes.date_demande', 'DESC')
            ->findAll();
---
SELECT `demandes`.*, `maisons`.`titre`, `maisons`.`loyer_mensuel`, `villes`.`nom` AS `nom_ville`
FROM `demandes`
JOIN `maisons` ON `maisons`.`id_maison` = `demandes`.`id_maison`
JOIN `villes` ON `villes`.`id_ville` = `maisons`.`id_ville`
WHERE `demandes`.`id_client` = 3
ORDER BY `demandes`.`date_demande` DESC