app/Models/MaisonModel.php

    public function listerDisponibles(?int $idVille = null): array
    {
        $builder = $this->select('maisons.*, villes.nom AS nom_ville')
            ->join('villes', 'villes.id_ville = maisons.id_ville')
            ->where('maisons.statut', 'disponible');

        if ($idVille !== null) {
            $builder = $builder->where('maisons.id_ville', $idVille);
        }

        return $builder->orderBy('maisons.cree_le', 'DESC')->findAll();
---
SELECT `maisons`.*, `villes`.`nom` AS `nom_ville`
FROM `maisons`
JOIN `villes` ON `villes`.`id_ville` = `maisons`.`id_ville`
WHERE `maisons`.`statut` = 'disponible'
ORDER BY `maisons`.`cree_le` DESC