app/Models/MaisonModel.php

    public function pourProprietaire(int $idProprietaire): array
    {
        return $this->where('id_proprietaire', $idProprietaire)
            ->orderBy('cree_le', 'DESC')
            ->findAll();
---
SELECT *
FROM `maisons`
WHERE `id_proprietaire` = 2
ORDER BY `cree_le` DESC

       public function trouverFicheDetail(int $idMaison): ?array
    {
        return $this->select('maisons.*, villes.nom AS nom_ville, villes.region AS region_ville')
            ->join('villes', 'villes.id_ville = maisons.id_ville')
            ->where('maisons.id_maison', $idMaison)
            ->first();
---
SELECT `maisons`.*, `villes`.`nom` AS `nom_ville`, `villes`.`region` AS `region_ville`
FROM `maisons`
JOIN `villes` ON `villes`.`id_ville` = `maisons`.`id_ville`
WHERE `maisons`.`id_maison` = 1
 LIMIT 1

     public function listerDisponibles(?int $idVille = null): array
    {
        $builder = $this->select('maisons.*, villes.nom AS nom_ville')
            ->join('villes', 'villes.id_ville = maisons.id_ville')
            ->where('maisons.statut', 'disponible');

        if ($idVille !== null) {
            $builder = $builder->where('maisons.id_ville', $idVille);
        }

        return $builder->orderBy('maisons.cree_le', 'DESC')->findAll();
---
SELECT `maisons`.*, `villes`.`nom` AS `nom_ville`
FROM `maisons`
JOIN `villes` ON `villes`.`id_ville` = `maisons`.`id_ville`
WHERE `maisons`.`statut` = 'disponible'
AND `maisons`.`id_ville` = 3
ORDER BY `maisons`.`cree_le` DESC