app/Models/MaisonPhotoModel.php

    public function pourMaison(int $idMaison): array
    {
        return $this->where('id_maison', $idMaison)
            ->orderBy('ordre', 'ASC')
            ->findAll();
---
SELECT *
FROM `maison_photos`
WHERE `id_maison` = 1
ORDER BY `ordre` ASC