app/Models/NotificationModel.php

    public function pourUtilisateur(int $idUtilisateur): array
    {
        return $this->where('id_utilisateur', $idUtilisateur)
            ->orderBy('cree_le', 'DESC')
            ->findAll();
---
SELECT *
FROM `notifications`
WHERE `id_utilisateur` = 3
ORDER BY `cree_le` DESC

    public function compterNonLues(int $idUtilisateur): int
    {
        return $this->where('id_utilisateur', $idUtilisateur)
            ->where('lue', 0)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `id_utilisateur` = 3
AND `lue` = 0

    public function marquerToutesCommeLues(int $idUtilisateur): void
    {
        $this->where('id_utilisateur', $idUtilisateur)
            ->where('lue', 0)
            ->set(['lue' => 1])
            ->update();
---
UPDATE `notifications` SET `lue` = 1
WHERE `id_utilisateur` = 3
AND `lue` = 0