app/Models/UtilisateurModel.php

SELECT *
FROM `utilisateurs`
WHERE `email` = 'client.test@cb-legaltech.mg'
AND `role` = 'client'
 LIMIT 1
---
    public function trouverParEmail(string $email, ?string $role = null): ?array
    {
        $builder = $this->where('email', $email);

        if ($role !== null) {
            $builder = $builder->where('role', $role);
        }

        return $builder->first();